first_routes/app/controllers/users_controller.rb

    def create

        user = User.new(params.require(:user).permit(:name, :email))
        if user.save
---
INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "Juan7"], ["email", "juan2@aol.co7"]]

    def update
        user = User.find(params[:id])

        if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "RALLES"], ["email", "RALLES@hotmail.com"], ["id", 2]]